import { TableItem } from '../../shared/types';
import { DEFAULT_DIAGRAM_URL } from '../../shared/constants';

export const chapaPerfuradaRedondo: TableItem = {
    name: "Chapa Perfurada - Furo Redondo",
    description: "Tabela de especificações para Chapa Perfurada com Furos Redondos - Disposição Alternada.",
    imageUrls: [DEFAULT_DIAGRAM_URL],
    headerGroups: [
        [
            { text: "Chapa Perfurada - Furo Redondo", colSpan: 4, className: "bg-brand-blue-dark border-b border-white/20 text-center" }
        ],
        [
            { text: "Ø dos furos", colSpan: 1, className: "bg-brand-blue-dark border-r border-white/20 text-center align-middle" },
            { text: "E.C", colSpan: 2, className: "bg-brand-blue-dark border-r border-white/20 text-center align-middle" },
            { text: "Área Aberta", colSpan: 1, rowSpan: 2, className: "bg-brand-blue-dark text-center align-middle" }
        ]
    ],
    headers: ["(mm)", "Pol.", "(mm)"],
    "rows": [
        ["0,8", "1/32\"", "1,6", "23%"],
        ["1", "0,40\"", "2", "22%"],
        ["1,2", "3/64\"", "2,2", "27%"],
        ["1,5", "0,59\"", "3", "23%"],
        ["1,8", "0,71\"", "3", "32%"],
        ["2", "5/64\"", "3", "40%"],
        ["2", "5/64\"", "4", "23%"],
        ["2,5", "3/32\"", "4", "32%"],
        ["2,8", "7/64\"", "4", "44%"],
        ["3,2", "1/8\"", "5", "36%"],
        ["3,2", "1/8\"", "6", "25%"],
        ["4", "5/32\"", "6", "40%"],
        ["4", "5/32\"", "7", "29%"],
        ["4,8", "3/16\"", "7", "42%"],
        ["4,8", "3/16\"", "8", "32%"],
        ["4,8", "3/16\"", "10", "21%"],
        ["5", "-", "7", "46%"],
        ["5", "-", "8", "35%"],
        ["5", "-", "10", "22%"],
        ["5,6", "7/32\"", "8", "43%"],
        ["5,6", "7/32\"", "10", "28%"],
        ["6,4", "1/4\"", "9", "45%"],
        ["6,4", "1/4\"", "10", "36%"],
        ["6,4", "1/4\"", "11", "30%"],
        ["9,5", "3/8\"", "13", "48%"],
        ["9,5", "3/8\"", "14", "41%"],
        ["12,7", "1/2\"", "18", "45%"],
        ["12,7", "1/2\"", "20", "36%"],
        ["12,7", "1/2\"", "24", "25%"],
        ["16", "5/8\"", "20", "57%"],
        ["16", "5/8\"", "24", "40%"],
        ["19", "3/4\"", "26", "48%"],
        ["19", "3/4\"", "32", "32%"],
        ["19", "3/4\"", "34", "28%"],
        ["22,2", "7/8\"", "28", "57%"],
        ["22,2", "7/8\"", "32", "43%"],
        ["25,4", "1\"", "38", "40%"],
        ["28,6", "1.1/8\"", "40", "46%"],
        ["30,2", "1.3/16\"", "42", "46%"],
        ["31,8", "1.1/4\"", "48", "40%"],
        ["38,1", "1.1/2\"", "56", "42%"],
        ["44,4", "1.3/4\"", "62", "46%"],
        ["50,8", "2\"", "72", "45%"],
        ["63,5", "2.1/2\"", "84", "51%"],
        ["66,7", "2.5/8\"", "88", "52%"],
        ["76,2", "3\"", "96", "54%"]
    ]
};